In [1]:
# Import statements for all the packages needed

import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
% matplotlib inline

In [2]:
# import the income table and look at some of the data to see if it needs transforming or cleaning
income_df = pd.read_csv('income_per_person.csv',usecols=['country','2007','2008','2009','2010','2011','2012','2013','2014','2015','2016','2017','2018','2019'])
income_df.head()

,country,2007,2008,2009,2010,2011,2012,2013,2014,2015,2016,2017,2018,2019
0,Afghanistan,1460,1480,1760,1960,1910,2080,2120,2100,2070,2060,2060,2030,2070
1,Angola,6920,7820,7750,7690,7680,8040,8140,8240,8040,7570,7310,6930,6670
2,Albania,9180,9940,10.3k,10.8k,11.1k,11.3k,11.4k,11.6k,11.9k,12.3k,12.8k,13.4k,13.7k
3,Andorra,48.6k,46.3k,46.7k,43.6k,46.9k,46.9k,48.9k,50.2k,52.1k,53.9k,55.6k,57.6k,59.6k
4,United Arab Emirates,76.6k,68.8k,58.4k,54.9k,56.1k,57.4k,59.9k,62.4k,65.2k,66.5k,67.2k,67k,67.1k

We've only brought in data from 2007-2019, it's possible there are some rows will null data so we'll use `dropna` and `thresh=12` to remove those rows with 12 null values so there's at least two data points for each country. We'll use inplace to make these changes to the `income_df`.

In [3]:
income_df.dropna(thresh=12,inplace=True)
#inspect data using info
income_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 195 entries, 0 to 194
Data columns (total 14 columns):
country    195 non-null object
2007       195 non-null object
2008       195 non-null object
2009       195 non-null object
2010       195 non-null object
2011       195 non-null object
2012       195 non-null object
2013       195 non-null object
2014       195 non-null object
2015       195 non-null object
2016       195 non-null object
2017       195 non-null object
2018       195 non-null object
2019       195 non-null object
dtypes: object(14)
memory usage: 22.9+ KB

Lastly in order to analyse this data we need to unpivot the table so we have three columns, the country, year and average income. We can do this by using 
`melt`.

In [4]:
income_df_v2 = income_df.melt(id_vars=['country'], var_name='year', value_name='income')
#inspect data to check this has worked
income_df_v2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2535 entries, 0 to 2534
Data columns (total 3 columns):
country    2535 non-null object
year       2535 non-null object
income     2535 non-null object
dtypes: object(3)
memory usage: 59.5+ KB

We can see that the table has unpivoted as we expect. However we need to change the datatype from `object` to `int` so we can perform calculations.

In [5]:
income_df_v2['year']=income_df_v2['year'].astype(int)

Next we will do the exact same data preparation on all the other tables of data we need.

In [6]:
life_expectancy_df = pd.read_csv('life_expectancy.csv',usecols=['country','2007','2008','2009','2010','2011','2012','2013','2014','2015','2016','2017','2018','2019'])
life_expectancy_df.head()

,country,2007,2008,2009,2010,2011,2012,2013,2014,2015,2016,2017,2018,2019
0,Afghanistan,58.5,59.2,59.9,60.5,61.0,61.4,61.9,61.9,61.9,62.0,62.9,62.7,63.3
1,Angola,58.0,58.8,59.5,60.2,60.8,61.4,62.1,63.0,63.5,63.9,64.2,64.6,65.1
2,Albania,77.5,77.6,78.0,78.1,78.1,78.2,78.3,78.2,78.1,78.2,78.3,78.4,78.5
3,Andorra,81.7,81.8,81.8,81.8,81.9,81.9,82.0,82.0,82.0,82.1,82.1,82.1,82.2
4,United Arab Emirates,70.0,70.4,70.6,70.8,71.0,71.2,71.6,73.0,73.2,73.4,73.5,73.7,73.9

In [7]:
life_expectancy_df.dropna(thresh=12,inplace=True)
life_expectancy_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 195 entries, 0 to 194
Data columns (total 14 columns):
country    195 non-null object
2007       195 non-null float64
2008       195 non-null float64
2009       195 non-null float64
2010       195 non-null float64
2011       195 non-null float64
2012       195 non-null float64
2013       195 non-null float64
2014       195 non-null float64
2015       195 non-null float64
2016       195 non-null float64
2017       195 non-null float64
2018       195 non-null float64
2019       195 non-null float64
dtypes: float64(13), object(1)
memory usage: 22.9+ KB

In [8]:
life_expectancy_df_v2 = life_expectancy_df.melt(id_vars=['country'], var_name='year', value_name='life_expectancy')
life_expectancy_df_v2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2535 entries, 0 to 2534
Data columns (total 3 columns):
country            2535 non-null object
year               2535 non-null object
life_expectancy    2535 non-null float64
dtypes: float64(1), object(2)
memory usage: 59.5+ KB

In [9]:
life_expectancy_df_v2['year']=life_expectancy_df_v2['year'].astype(int)

In [10]:
women_in_parliment_df = pd.read_csv('women_in_parliment.csv',usecols=['country','2007','2008','2009','2010','2011','2012','2013','2014','2015','2016','2017','2018','2019'])
women_in_parliment_df.head()

,country,2007,2008,2009,2010,2011,2012,2013,2014,2015,2016,2017,2018,2019
0,Afghanistan,26.6,26.9,27.3,27.6,27.4,27.4,27.4,27.4,27.4,27.7,27.8,27.9,27.2
1,Angola,35.5,37.3,36.5,35.7,34.9,34.1,33.5,32.8,32.2,31.6,30.9,30.4,30.0
2,Albania,11.8,14.1,16.4,16.3,16.1,15.9,15.7,18.8,21.8,24.8,27.9,28.6,29.5
3,Andorra,33.3,33.7,33.9,42.9,51.8,50.0,47.6,44.3,39.3,41.1,42.9,44.6,46.4
4,United Arab Emirates,5.0,5.0,5.0,5.0,5.0,17.5,19.2,20.8,22.5,29.4,36.3,43.1,50.0

In [11]:
women_in_parliment_df.dropna(thresh=12,inplace=True)
women_in_parliment_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 181 entries, 0 to 192
Data columns (total 14 columns):
country    181 non-null object
2007       181 non-null float64
2008       181 non-null float64
2009       181 non-null float64
2010       181 non-null float64
2011       181 non-null float64
2012       181 non-null float64
2013       181 non-null float64
2014       181 non-null float64
2015       181 non-null float64
2016       181 non-null float64
2017       181 non-null float64
2018       181 non-null float64
2019       181 non-null float64
dtypes: float64(13), object(1)
memory usage: 21.2+ KB

In [12]:
women_in_parliment_df_v2 = women_in_parliment_df.melt(id_vars=['country'], var_name='year', value_name='women_in_parliment')
life_expectancy_df_v2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2535 entries, 0 to 2534
Data columns (total 3 columns):
country            2535 non-null object
year               2535 non-null int64
life_expectancy    2535 non-null float64
dtypes: float64(1), int64(1), object(1)
memory usage: 59.5+ KB

In [13]:
women_in_parliment_df_v2['year']=women_in_parliment_df_v2['year'].astype(int)

Now we have the data in the format we want we can save these tables to a csv file.

In [14]:
income_df_v2.to_csv('income_clean_df.csv', index=False)
life_expectancy_df_v2.to_csv('life_expectancy_clean.csv', index=False)
women_in_parliment_df_v2.to_csv('women_in_parliment_clean.csv', index=False)